stress_test/stressMeOut.yml
config:
  target: "http://localhost:3000"
  http:
    pool: 8 # All HTTP requests from all virtual users will be sent over the same 8 connections
  phases:
    - duration: 5
      arrivalRate: 10
      rampTo: 20
      name: "Warm up the application"
    - duration: 5
      arrivalRate: 20
      name: "Sustained high load"
    - duration: 5
      arrivalRate: 100
      name: "Spikes in service load"
  processor: "./randomUrl.js"

scenarios:
  - name: "Go to random URL"
    flow:
      - function: "generateRandomData"
      - loop:
          - get:
              url: "/restaurants/{{ id }}"
          - get:
              url: "/api/restaurants/{{ id }}/gallery"
        count: 20